trade_exp/src/InformationRegisters/АналогиНоменклатуры/АналогиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8fdb01f6-4967-4863-8211-300891e04633">
  <name>АналогиНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="5101c189-e0d9-4d7a-ad43-75fe9ff7c368">
    <name>Кратность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c8b16b72-9107-42cd-bc6b-e7ed0308c512">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="ed55715d-dbff-4f56-9d3f-c1366a117f76">
    <name>ОбратнаяАналогия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="56dd2c22-0fcc-4868-b308-1d6f8a56ed55">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ed23a32e-e185-4b37-b18e-204672040e54">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="8754e396-036b-4c70-867f-6bf8ed950029">
    <name>АналогНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="26f13074-bd31-45ce-8888-d525330b5e0b">
    <name>АналогХарактеристики</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/АналогиНоменклатуры/Forms/ФормаДоп/Module.bsl
&НаСервере
Процедура ЗагрузитьНаСервере()
    КолонкаИндекса = 1;
	
    ТаблицаДанных = Новый ТаблицаЗначений;
	
	НомерКолонки = 0;
	Пока Истина Цикл
	    НомерКолонки = НомерКолонки + 1;
	    ИмяКолонки = Аналоги.Область(1, НомерКолонки).Текст;
	    Если ПустаяСтрока(ИмяКолонки) Тогда
	        Прервать;
	    КонецЕсли;        
        ТаблицаДанных.Колонки.Добавить(ИмяКолонки);
	КонецЦикла;
    
    СчетчикКолонок = НомерКолонки - 1;
    
    НомерСтроки = 1; ФлагПрерывания = Ложь;
    Пока Истина Цикл
        НомерСтроки = НомерСтроки + 1;
        Стр = ТаблицаДанных.Добавить();
        
        Для А = 1 ПО СчетчикКолонок Цикл
            ТекстКолонки = Аналоги.Область(НомерСтроки, А).Текст;
            Если ПустаяСтрока(ТекстКолонки) Тогда
                Если А = КолонкаИндекса Тогда
                    Флагпрерывания = Истина;
                    ТаблицаДанных.Удалить(Стр);
                КонецЕсли;
            Иначе
                Стр[А - 1] = ТекстКолонки
            КонецЕсли;
            
            Если Флагпрерывания Тогда
                Прервать
            КонецЕсли;
        КонецЦикла;
        
        Если Флагпрерывания Тогда
            Прервать
        КонецЕсли;
	КонецЦикла;
	
	ТаблицаЗначений.Очистить();
	
	Для каждого Строка из ТаблицаДанных Цикл
		
		Если ЗначениеЗаполнено(Строка.Номенклатура) И ЗначениеЗаполнено(Строка.АналогНоменклатуры) Тогда
			
			НоваяСтрока = ТаблицаЗначений.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			
			Если Не ПустаяСтрока(Строка.Номенклатура) Тогда
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоКоду(Строка.Номенклатура);
				Если Не ПустаяСтрока(Строка.Характеристика) Тогда
					НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду(Строка.Характеристика,,,НоваяСтрока.Номенклатура);
				КонецЕсли;
			КонецЕсли;
			
			Если Не ПустаяСтрока(Строка.АналогНоменклатуры) Тогда 
				НоваяСтрока.АналогНоменклатуры = Справочники.Номенклатура.НайтиПоКоду(Строка.АналогНоменклатуры);
				Если Не ПустаяСтрока(Строка.АналогХарактеристики) Тогда
					НоваяСтрока.АналогХарактеристики = Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду(Строка.АналогХарактеристики,,,НоваяСтрока.АналогНоменклатуры);
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;

	Если МножественныйАналог Тогда
	     ОбработатьТаблицуЗначений();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
	Закрыть(ТаблицаЗначений);
КонецПроцедуры

Процедура ОбработатьТаблицуЗначений()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_Временная
		|ИЗ
		|	&ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Временная.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВТ_Временная КАК ВТ_Временная";
	
	Запрос.УстановитьПараметр("ВнешняяТаблицаНоменклатуры",ТаблицаЗначений.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗНоменклатура.Загрузить(РезультатЗапроса.Выгрузить());
	
	МассивТаблиц = Новый Массив;
	
	Для каждого Строка из ТЗНоменклатура Цикл
		Отбор = Новый Структура;
        Отбор.Вставить("Номенклатура", Строка.Номенклатура);
        НайденныеСтроки = ТаблицаЗначений.НайтиСтроки(Отбор);
		МассивТаблиц.Добавить(НайденныеСтроки);
	КонецЦикла;
	
	Для каждого Строка из МассивТаблиц Цикл
		Количество = Строка.Количество()-1;
		Если Количество > 0 Тогда
			Для Инд1=0 по Количество Цикл
				Для Инд2=Инд1+1 по Количество Цикл
					НоваяСтрока = ТаблицаЗначений.Добавить();
					НоваяСтрока.Номенклатура = Строка[Инд1].АналогНоменклатуры;
					НоваяСтрока.АналогНоменклатуры = Строка[Инд2].АналогНоменклатуры;
					Если ЗначениеЗаполнено(Строка[Инд2].Кратность) И ЗначениеЗаполнено(Строка[Инд1].Кратность) Тогда
						Кратность = Строка[Инд2].Кратность/Строка[Инд1].Кратность;
						Если Кратность>=1 Тогда
							НоваяСтрока.Кратность = Цел(Кратность);
						Иначе
							НоваяСтрока.Кратность = Окр(Кратность,1);
						КонецЕсли;
					КонецЕсли;
					НоваяСтрока.ОбратнаяАналогия = Истина;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры
